package com.example.trafficsignrecognition.util;


import com.example.trafficsignrecognition.R;

public class ConstantUtil {



    public static final int TEXT_SIZE = 17;
    public static final int ALERT_SIZE = 10;
    public static final String DETECT_MODEL = "YOLOv8n_int8.tflite";
    public static final String RECOGNIZE_MODEL = "new_cnn.tflite";
    public static final String AM_MODEL = "fastspeech2_csmsc_arm.nb";
    public static final String VO_MODEL = "mb_melgan_csmsc_arm.nb";
    public static final String EMAIL_USER = "17513266240@163.com";
    public static final String EMAIL_PASSWORD = "BGfBi349FqHD8PF9";

    public static final int[] id = {
            R.drawable.traffic0, R.drawable.traffic1, R.drawable.traffic2,R.drawable.traffic3,
            R.drawable.traffic4, R.drawable.traffic5, R.drawable.traffic6,R.drawable.traffic7,
            R.drawable.traffic8, R.drawable.traffic9, R.drawable.traffic10,R.drawable.traffic11,
            R.drawable.traffic12, R.drawable.traffic13, R.drawable.traffic14,R.drawable.traffic15,
            R.drawable.traffic16, R.drawable.traffic17, R.drawable.traffic18,R.drawable.traffic19,
            R.drawable.traffic20,R.drawable.traffic21,R.drawable.traffic22,R.drawable.traffic23,
            R.drawable.traffic24,R.drawable.traffic25,R.drawable.traffic26,R.drawable.traffic27,
            R.drawable.traffic28,R.drawable.traffic29,R.drawable.traffic30,R.drawable.traffic31,
            R.drawable.traffic32,R.drawable.traffic33,R.drawable.traffic34,R.drawable.traffic35,
            R.drawable.traffic36,R.drawable.traffic37,R.drawable.traffic38,R.drawable.traffic39,
            R.drawable.traffic40,R.drawable.traffic41,R.drawable.traffic42
    };

    public static final String[] name = {
            "限速20km/h", "限速30km/h","限速50km/h","限速60km/h",
            "限速70km/h","限速80km/h","解除限速80km/h","限速100km/h",
            "限速120km/h","禁止超车","禁止货车超车","干路先行",
            "优先道路","减速让行","停车让行","禁止通行",
            "禁止货车通行","禁止驶入","注意危险","左急转弯",
            "右急转弯","双弯道","颠簸道路","湿滑道路",
            "右侧道路变窄","道路施工","注意信号灯","注意行人",
            "注意儿童","注意非机动车","注意路面结冰","注意野生动物",
            "解除速度和超车限制","向右转弯","向左转弯","直行",
            "直行和向右转弯","直行和向左转弯","分隔带右侧行驶","分隔带左侧行驶",
            "环岛行驶","解除超车限制","解除货车超车限制"
    };
    //179:sp
    public static final float[][] phoneId = {
            //前方限速20km/h
            {174,83,69,19,260,85,176,186,67, 177,114, 174,82,154,74,154,48,260,98,177,114,179},
            //前方限速30km/h
            {174,83,69,19,260,85,176,186, 176,14, 177,114, 174,82,154,74,154,48,260,98,177,114,179},
            //前方限速50km/h
            {174,83,69,19,260,85,176,186,185,177,114,174,82,154,74,154,48,260,98,177,114,179},
            //前方限速60km/h
            {174,83,69,19,260,85,176,186,153,143,177,114,174,82,154,74,154,48,260,98,177,114,179},
            //前方限速70km/h
            {174,83,69,19,260,85,176,186,174,72,177,114,174,82,154,74,154,48,260,98,177,114,179},
            //前方限速80km/h
            {174,83,69,19,260,85,176,186,37,2,177,114,174,82,154,74,154,48,260,98,177,114,179},
            //前方解除限速80km/h
            {174,83,69,19,151,105,39,184,260,85,176,186,37,2,177,114,174,82,154,74,154,48,260,98,177,114},
            //前方限速100km/h
            {174,83,69,19,260,85,176,186,75,37,9,174,82,154,74,154,47,260,98,177,114,179},
            //前方限速120km/h
            {174,83,69,19,260,85,176,186,72,37,9,67,177,114,174,82,154,74,154,48,260,98,177,114,179},
            //前方禁止超车
            {174,83,69,19,151,123,262,115,39,27,39,41,179},
            //前方禁止货车超车
            {174,83,69,19,151,123,262,115,71,233,39,41,39,27,39,41,179},
            //前方干路先行
            {174,83,69,19,70,17,153, 186, 260,82,260,126,179},
            //前方为优先道路
            {174,83,69,19,212,140,260,82,40,30,153,186,179},
            //前方请减速让行
            {174,83,69,19,174,126,151,84,176,186,175,22,260,126,179},
            //前方请停车让行
            {174,83,69,19,174,127,182,126,39,41,175,22,260,126,179},
            //前方禁止通行
            {174,83,69,19,151,123,262,115,182,161,260,126,179},
            //前方禁止货车通行
            {174,83,69,19,151,123,262,115,71,233,39,41,182,161,260,126,179},
            //前方禁止驶入
            {174,83,69,19,151,123,262,115,177,115,175,186,179},
            //前方注意危险
            {174,83,69,19,262,186,75,211,260,84,179},
            //前方注意左急转弯
            {174,83,69,19,262,186,75,261,232,151,73,262,201,199,179},
            //前方注意右急转弯
            {174,83,69,19,262,186,75,143,151,73,262,201,199,179},
            //前方注意双弯道
            {174,83,69,19,262,186,75,177,204,199,40,30,179},
            //前方注意颠簸道路
            {174,83,69,19,262,186,75,40,82,37,158,40,30,153,186,179},
            //前方注意湿滑道路
            {174,83,69,19,262,186,75,177,113,71,189,40,30,153,186,179},
            //前方注意右侧道路变窄
            {174,83,69,19,262,186,75,143,38,44,40,30,153,186,37,85,262,9,179},
            //前方注意道路施工
            {174,83,69,19,262,186,75,40,30,153,186,177,113,70,161,179},
            //前方注意信号灯
            {174,83,69,19,262,186,75,260,123,71,30,40,56,179},
            //前方注意行人
            {174,83,69,19,262,186,75,260,126,175,52,179},
            //前方注意儿童
            {174,83,69,19,262,186,75,65,182,162,179},
            //前方注意非机动车
            {174,83,69,19,262,186,75,69,46,151,72,40,164,39,41,179},
            //前方注意路面结冰
            {174,83,69,19,262,186,75,153,186,154,85,151,104,37,125,179},
            //前方注意野生动物
            {174,83,69,19,262,186,75,105,177,56,40,164,186,179},
            //前方解除速度和超车限制
            {174,83,69,19,151,105,39,184,176,186,40,186,71,42,39,27,39,41,260,85,262,116,179},
            //前方向右转弯
            {174,83,69,19,260,90,143,262,201,199,179},
            //前方向左转弯
            {174,83,69,19,260,90,261,232,262,201,199,179},
            //前方直行
            {174,83,69,19,262,114,260,126,179},
            //前方直行和向右转弯
            {174,83,69,19,262,114,260,126,71,42,260,90,143,262,201,199,179},
            //前方直行和向左转弯
            {174,83,69,19,262,114,260,126,71,42,260,90,261,232,262,201,199,179},
            //前方分隔带右侧行驶
            {174,83,69,19,69,51,70,42,40,10,143,38,44,260,126,177,115,179},
            //前方分隔带左侧行驶
            {174,83,69,19,69,51,70,42,40,10,261,232,38,44,260,126,177,115,179},
            //前方环岛行驶
            {174,83,69,19,71,200,40,29,260,126,177,115,179},
            //前方解除超车限制
            {174,83,69,19,151,105,39,184,39,27,39,41,260,85,262,116,179},
            //前方解除货车超车限制
            {174,83,69,19,151,105,39,184,71,233,39,41,39,27,39,41,260,85,262,116,179}
    };
    public static final String[] description = {
            "表示该标志至前方解除限制速度标志或另一块不同限速值的限制速度标志的路段内，机动车行驶速度不准超过20km/h。",
            "表示该标志至前方解除限制速度标志或另一块不同限速值的限制速度标志的路段内，机动车行驶速度不准超过30km/h。",
            "表示该标志至前方解除限制速度标志或另一块不同限速值的限制速度标志的路段内，机动车行驶速度不准超过50km/h。",
            "表示该标志至前方解除限制速度标志或另一块不同限速值的限制速度标志的路段内，机动车行驶速度不准超过60km/h。",
            "表示该标志至前方解除限制速度标志或另一块不同限速值的限制速度标志的路段内，机动车行驶速度不准超过70km/h。",
            "表示该标志至前方解除限制速度标志或另一块不同限速值的限制速度标志的路段内，机动车行驶速度不准超过80km/h。",
            "表示限制速度路段结束。",
            "表示该标志至前方解除限制速度标志或另一块不同限速值的限制速度标志的路段内，机动车行驶速度不准超过100km/h。",
            "表示该标志至前方解除限制速度标志或另一块不同限速值的限制速度标志的路段内，机动车行驶速度不准超过120km/h。",
            "表示该标志至前方解除禁止超车标志的路段内，不准许机动车超车。",
            "表示该标志至前方解除禁止超车标志的路段内，不准许货车超车。",
            "表示该干路优先通行。",
            "表示该道路为优先道路。",
            "表示相交道路有优先通行权，车辆应慢行或停车，观察相交道路行车情况，让相交道路车辆优先通行和确认安全时，方可通行。",
            "表示车辆必须在进入路口前完全停止，确认安全后，方可通行。",
            "表示禁止一切车辆和行人通行。",
            "表示禁止载货汽车驶入（含载货专项作业车）。",
            "表示禁止一切车辆驶入（含非机动车）。",
            "用以提醒车辆驾驶人谨慎驾驶，注意危险。",
            "用以警告车辆驾驶人前方是向左急弯路。",
            "用以警告车辆驾驶人前方是向右急弯路。",
            "用以警告车辆驾驶人前方有连续两个弯路。",
            "用以提醒车辆驾驶人减速慢行，注意路面颠簸。",
            "用以提醒车辆驾驶人减速慢行，注意路滑。",
            "用以警告车辆驾驶人注意前方车行道或路面狭窄情况，遇有来车应予减速避让。",
            "用以警告前方道路施工，车辆驾驶人应减速慢行或绕道行驶。",
            "用以警告车辆驾驶人注意前方路段设有信号灯，应依信号灯指示行车。",
            "用以警告车辆驾驶人减速慢行，注意行人。",
            "用以警告车辆驾驶人减速慢行，注意儿童。",
            "用以提醒车辆驾驶人谨慎驾驶，注意非机动车。",
            "用以警告车辆驾驶人注意路面结冰。",
            "用以提醒车辆驾驶人谨慎驾驶，注意野生动物。",
            "表示解除速度和超车限制。",
            "表示一切车辆只准向右转弯。",
            "表示一切车辆只准向左转弯。",
            "表示一切车辆只准直行。",
            "表示一切车辆只准直行和向右转弯。",
            "表示一切车辆只准直行和向左转弯。",
            "表示一切车辆只准在分隔设施的右侧行驶。",
            "表示一切车辆只准在分隔设施的左侧行驶。",
            "表示一切车辆只准靠右环行，环内车辆具有优先权，车辆进入环岛时应让环内车辆优先通行。",
            "表示解除机动车超车限制。",
            "表示解除货车超车限制。"
    };
}
